{
  "movies": [
    {
      "ID": 1,
      "TITLE": "Tenet",
      "DIRECTOR": "Christopher Nolan",
      "ACTOR": "Christian Bale",
      "CATEGORYID": 1,
      "IMBDURL": "https://www.imdb.com/title/tt6723592/?ref_=adv_li_tt",
      "COVERURL": "https://www.imdb.com/title/tt6723592/mediaviewer/rm1748282625/?ref_=ext_shr_lnk",
      "DATE": "12/07/2021",
      "TIMEID": 1,
      "PRICEID": 2,
      "DESCRIPTION": "fter having a near-death experience, an unnamed CIA operative, known as the Protagonist, is selected to join the ranks of the shadowy government organization called Tenet: a group tasked with ensuring the survival of the human race. Entrusted with coming to grips with a terrifying, cutting-edge technology, and an imminent attack from the future, the Protagonist teams up with his cryptic new partner, Neil, following a faint trail of clues that lead to the villainous Russian oligarch, Sator. However, this is a race against time, and as the suffocating stranglehold of the invisible threat tightens, more and more, the future of our world is hanging by a thread. Can two agents working alone avert the impending Armageddon?"
    },
    {
      "ID": 2,
      "TITLE": "The Dark Knight Rises",
      "DIRECTOR": "Christopher Nolan",
      "ACTOR": "Christian Bale",
      "CATEGORYID": 2,
      "IMBDURL": "https://www.imdb.com/title/tt1345836/?ref_=ttls_li_tt",
      "COVERURL": "https://www.imdb.com/title/tt1345836/mediaviewer/rm834516224/?ref_=ext_shr_lnk",
      "DATE": "20/07/2021",
      "TIMEID": 1,
      "PRICEID": 2,
      "DESCRIPTION": "Eight years after the events of The Dark Knight (2008) find Gotham at a time of peace. This is due to Batman taking the fall for Harvey Dent's murder. However, a new evil force named Bane has arrived in Gotham and aims to take over the city and expose the truth behind who Harvey Dent really was. Now that Wayne Manor has been completely rebuilt, Bruce Wayne has become almost reclusive, rarely leaving the estate. And with Bane taking over the city by force, it forces Batman to come out of retirement. But his allies are few and far between. An elusive jewel thief by the name of Selina Kyle could be the key to stopping Bane, but whose side is she on?"
    },
    {
      "ID": 3,
      "TITLE": "The Chef",
      "DIRECTOR": "Daniel Cohen",
      "ACTOR": "Jean Reno",
      "CATEGORYID": 3,
      "IMBDURL": "https://www.imdb.com/title/tt1911553/?ref_=ttls_li_tt",
      "COVERURL": "http://ecx.images-amazon.com/images/I/51XoshEXVEL.jpg",
      "DATE": "22/07/2021",
      "TIMEID": 2,
      "PRICEID": 3,
      "DESCRIPTION": "Jacky Bonnot is 32 years old and a lover of haute cuisine. He is undeniably talented and he dreams of success managing a great restaurant, but he and his wife's financial situation obliges him to accept odd jobs that he is not passionate about and thus, never able to keep. One day he runs into his idol, Alexandre Lagarde, a famous multi-star chef whose comfortable situation is threatened by the holding group that owns his restaurants."
    },
    {
      "ID": 4,
      "TITLE": "Coyote Ugly",
      "DIRECTOR": "David McNally",
      "ACTOR": "Piper Perabo",
      "CATEGORYID": 4,
      "IMBDURL": "https://www.imdb.com/title/tt0200550/?ref_=ttls_li_tt",
      "COVERURL": "https://www.imdb.com/title/tt0200550/mediaviewer/rm1674468608/?ref_=ext_shr_lnk",
      "DATE": "30/07/2021",
      "TIMEID": 5,
      "PRICEID": 4,
      "DESCRIPTION": "When young Violet finally follows her dream and moves to New York to become a songwriter, she knows little about the big city. All her efforts to get a demo tape to a producer are useless, additionally her apartment is broken in to, leaving her with nothing. But a coincidence leads her to Coyote Ugly, a night club where only beautiful women call the shots, using their female attraction to drive the guests just crazy. Violet manages to get a position and starts learning the ways of the city. After getting in trouble because of a misunderstanding, Violet's new friend Kevin tries to rid her of her stage fear so that she can perform her songs herself. Violet's father Bill does not like her new job as well as her leaving him, but it's all part of growing up."
    },
    {
      "ID": 5,
      "TITLE": "Marriage Story",
      "DIRECTOR": "Noah Baumbach",
      "ACTOR": "Scarlett Johansson",
      "CATEGORYID": 5,
      "IMBDURL": "https://www.imdb.com/title/tt7653254/",
      "COVERURL": "https://www.imdb.com/title/tt7653254/mediaviewer/rm1922861057/?ref_=ext_shr_lnk",
      "DATE": "20/07/2021",
      "TIMEID": 4,
      "PRICEID": 3,
      "DESCRIPTION": "Sadly, after numerous disastrous sessions of marital mediation, New York City's brilliant theatre director, Charlie, and the one-time Los Angeles movie actress, Nicole, decided to split up, putting an end to their decade-long marriage. However, divorce is horrible--and as the once-close-knit couple struggles to make it work for the sake of their eight-year-old son, Henry--vitriolic accusations and bitter resentment threaten the very foundation of Charlie and Nicole's so-called amicable separation. Now, shrewd and absurdly costly lawyers take over, and things are bound to get messy. But, why are love's wounds so deep, and cruelly painful? In the end, is love always forever?"
    },
    {
      "ID": 6,
      "TITLE": "The Crown ",
      "DIRECTOR": "Peter Morgan",
      "ACTOR": "Claire Foy",
      "CATEGORYID": 6,
      "IMBDURL": "https://www.imdb.com/title/tt4786824/?ref_=adv_li_i",
      "COVERURL": "https://www.imdb.com/title/tt4786824/mediaviewer/rm2835667201/?ref_=ext_shr_lnk",
      "DATE": "15/07/2021",
      "TIMEID": 3,
      "PRICEID": 1,
      "DESCRIPTION":  "This show focuses on Queen Elizabeth II as a young newlywed faced with leading the world's most famous monarchy, while forging a relationship with legendary Prime Minister Sir Winston Churchill. The British Empire is in decline, the political world is in disarray, but a new era is dawning. Peter Morgan's masterfully researched scripts reveal the Queen's private journey behind the public façade with daring frankness. Prepare to see into the coveted world of power and privilege behind the locked doors of Westminster and Buckingham Palace."
    }
  ]
}