[
  {
    "id": 1,
    "title": "Tenet",
    "director": "Christopher Nolan",
    "actor": "Christian Bale",
    "categoryId": 1,
    "imbdUrl": "https://www.imdb.com/title/tt6723592/?ref_=adv_li_tt",
    "coverUrl": "https://m.media-amazon.com/images/M/MV5BYzg0NGM2NjAtNmIxOC00MDJmLTg5ZmYtYzM0MTE4NWE2NzlhXkEyXkFqcGdeQXVyMTA4NjE0NjEy._V1_UX182_CR0,0,182,268_AL_.jpg",
    "viewDate": "2021-05-07",
    "timeId": 6,
    "priceId": 5,
    "trailer": "https://www.youtube.com/embed/AZGcmvrTX9M",
    "description": "After having a near-death experience, an unnamed CIA operative, known as the Protagonist, is selected to join the ranks of the shadowy government organization called Tenet: a group tasked with ensuring the survival of the human race. Entrusted with coming to grips with a terrifying, cutting-edge technology, and an imminent attack from the future, the Protagonist teams up with his cryptic new partner, Neil, following a faint trail of clues that lead to the villainous Russian oligarch, Sator. However, this is a race against time, and as the suffocating stranglehold of the invisible threat tightens, more and more, the future of our world is hanging by a thread. Can two agents working alone avert the impending Armageddon?",
    "owner": 1
  },
  {
    "id": 2,
    "title": "The Dark Knight Rises",
    "director": "Christopher Nolan",
    "actor": "Christian Bale",
    "categoryId": 2,
    "imbdUrl": "https://www.imdb.com/title/tt1345836/?ref_=ttls_li_tt",
    "coverUrl": "https://m.media-amazon.com/images/M/MV5BMTk4ODQzNDY3Ml5BMl5BanBnXkFtZTcwODA0NTM4Nw@@._V1_UX182_CR0,0,182,268_AL_.jpg",
    "viewDate": "2021-05-07",
    "timeId": 4,
    "priceId": 4,
    "trailer": "https://www.youtube.com/embed/GokKUqLcvD8",
    "description": "Eight years after the events of The Dark Knight (2008) find Gotham at a time of peace. This is due to Batman taking the fall for Harvey Dent's murder. However, a new evil force named Bane has arrived in Gotham and aims to take over the city and expose the truth behind who Harvey Dent really was. Now that Wayne Manor has been completely rebuilt, Bruce Wayne has become almost reclusive, rarely leaving the estate. And with Bane taking over the city by force, it forces Batman to come out of retirement. But his allies are few and far between. An elusive jewel thief by the name of Selina Kyle could be the key to stopping Bane, but whose side is she on?",
    "owner": 1
  }
]